;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

(package! flycheck-pos-tip)
(package! open-junk-file)

(package! org-ref)
(package! ebib)
(package! org-roam-bibtex)
(package! org-roam-server)
(package! ivy-bibtex)

(package! git-auto-commit-mode)
